Autodesk.Revit.DB.LayoutRuleMaximumSpacing.Spacing
Get or set the spacing of the beam system.
Remarks: The value of spacing must be in (0, 30000), but in fact the spacing
should not be too small or too great.

Autodesk.Revit.DB.LayoutRuleMaximumSpacing.#ctor(System.Double)
Constructor of LayoutRuleMaximumSpacing.
spacing:  The value of spacing must be in (0, 30000).
Remarks: The value of spacing must be in (0, 30000), but in fact the spacing
should not be too small or too great.

Autodesk.Revit.DB.LayoutRuleMaximumSpacing
This class indicate the layout rule of a Beam System is Max-Spacing.
Remarks: To use this type of LayoutRule, only the maximum spacing must be set and it must be in (0, 30000).